{
  "global": {
    "author": {
      "headline": "Senior/Lead Front-End Engineer | React | Next.js | TypeScript | Tailwind CSS | Contentful | Stripe | AWS | Vercel"
    },
    "copyright": "All rights reserved.",
    "menu": {
      "experience": {
        "href": "/experience",
        "title": "Experience"
      },
      "education": {
        "href": "/education",
        "title": "Education"
      },
      "skills": {
        "href": "/skills",
        "title": "Skills"
      },
      "recommendations": {
        "href": "/recommendations",
        "title": "Recommendations"
      }
    }
  },
  "home": {
    "greeting": "Hey, I'm",
    "summary": [
      "A Senior/Lead Front-End Engineer with 13+ years of experience helping US-based companies build intuitive user interfaces, ensuring code quality, high performance, scalability, accessibility, and security. Specialized in React, Next.js, TypeScript, and Tailwind CSS, now powered by top AI tools to go even faster.",
      "Currently working at Lovevery, delivering meaningful projects like the New Checkout with a net gain of 7.3 new checkouts per day and the ERC launch to reach more than 455k customers in just a few months.",
      "What I like most about Front-End is combining clean code, best practices, and design to create products that truly make a difference for real users and bring remarkable business results!"
    ],
    "imageAltText": "Photo of the author"
  },
  "experience": {
    "title": "Experience",
    "menu": {
      "simple": "simple",
      "detailed": "detailed"
    },
    "dateSeparatorText": "to",
    "endDateText": "present",
    "mainStackTitle": "Main stack",
    "items": {
      "lovevery-1": {
        "role": "Senior Front-End Engineer",
        "accomplishments": [
          "Reduced front-end build time by 95% (40s → 2s) through deep refactoring and dependency optimization, accelerating CI/CD pipelines and developer iteration speed;",
          "Built a new Stripe-powered checkout experience supporting 4 countries and 5 languages, resulting in a net gain of +7.3 checkouts/day and 20% higher test coverage;",
          "Launched the ERC product journey that reached 455K+ new customers in just a few months, helping scale Lovevery's ecommerce reach and conversion funnel;"
        ]
      },
      "yestechnology-1": {
        "role": "Lead Front-End Engineer",
        "accomplishments": [
          "Led the Design System project, implementing components to support the whole company ecosystem, keeping a maintainable and scalable codebase, very well aligned with the company's brand and design principles;",
          "Created a few dynamic components to support a new client website, making the customizations needed to fit the client's requirements;",
          "Added some new features to the company's main app, improving the user experience and the code quality;"
        ]
      },
      "pdsacademy-1": {
        "role": "Post-graduation Professor",
        "accomplishments": [
          "Taught 16+ hours of Front-End Fundamentals with React;",
          "Led interactive sessions with Q&A, focusing on React best practices, design patterns, and developer efficiency;",
          "Created base projects and shared with students to practice the concepts learned;"
        ]
      },
      "danielxavier-1": {
        "role": "Senior Full-Stack Engineer",
        "accomplishments": [
          "Created a high-performance and fully accessible professional portfolio website using React/Tailwind CSS to handle routing in the front, Next.js/Node.js to provide Server Side Rendering in the back end, Jest/Cypress to provide 100% code coverage, including some visual tests, and Vercel's Frontend Cloud for deployment;",
          "Delivered a dynamic medical report printing platform built with React and Next.js/Node.js (SSR), hosted on Vercel for rapid deployment and scalability;",
          "Developed a ticket booking API using Nest.js, Kong, and MySQL, showcasing strong backend design and DevOps integration;"
        ]
      },
      "olx-1": {
        "role": "Engineering Manager",
        "accomplishments": [
          "Launched the new Ad Insertion experience, increasing ad posting conversions and simplifying the selling process for millions of users;",
          "Shipped a machine learning-powered LTR algorithm that boosted ad recommendation engagement by 10%;",
          "Delivered a brand new homepage in under 48 hours, supported by the Design System, to accelerate validation and rollout;",
          "Made some advertising improvements to the platform that generated revenue of R$80 million;",
          "Recruited new professionals to increase production capacity by 300%, and be able to focus on the functionalities of the mobile application;"
        ]
      },
      "meaning-1": {
        "role": "CTO & Partner",
        "accomplishments": [
          "Defined the technical vision and product roadmap from scratch, translating the company's business goals into an executable engineering strategy;",
          "Collaborated directly with founders and product stakeholders to iterate rapidly and align technical direction with customer feedback;",
          "Built and launched the MVP platform, acquiring 4 clients within the first months and establishing scalable cloud infrastructure on GCP;"
        ]
      },
      "softplan-3": {
        "role": "Team Leader",
        "accomplishments": [
          "Directly led a multidisciplinary software development team of 28 people including Developers, Quality Assurance analysts, Product Owners, Business Analysts, and Agile Masters;",
          "Made bi-weekly 1:1s to help the devs with the technical challenges, to help the QAs integrate their tasks with the team process flows, avoid creating bottlenecks and develop new automation test approaches, and the PO/BAs to handle the customer's urgent needs;",
          "Also guided the agile masters to structure and continuously enhance the team's workflow using agile software development methodologies;",
          "Planned and executed deliveries for the most 2 critical modules of the core system;",
          "Created formulas and metrics to accurately gauge the team's capacity, and sprint velocity, thereby bringing predictability to deliveries;"
        ]
      },
      "softplan-2": {
        "role": "Technical Lead",
        "accomplishments": [
          "Developed some Front-End modules for the new core system, constructed using React and a Micro Frontend approach;",
          "Handled for the code reviews, deliveries, and deployment of 17 modules of the system;",
          "Formed the Delphi developers team up to work with HTML, CSS, JavaScript, React, GraphQL, and unit tests;",
          "Led a team of 10 Front-End developers, doing weekly 1:1s, and partnering with their coordinators to do career plans;",
          "Hired tons of new employees for the company and new contractor professionals aligned with our development culture;"
        ]
      },
      "softplan-1": {
        "role": "Senior Front-End Engineer",
        "accomplishments": [
          "Successfully delivered the team's most critical and complex project in less than 6 months, helping the Product Owner improve some features;",
          "Developed new features for the public portal helping attorneys in their jobs;",
          "Created new features for the core system helping tons of law professionals in their work;"
        ]
      },
      "hotmart-3": {
        "role": "Senior Full-Stack Engineer",
        "accomplishments": [
          "Designed and implemented a system to address the company's internal needs and automate tasks, using Vue.js/Nuxt.js for the user interface, Node.js/Express for the data requests, and MySQL for storing data, that brought more than 1000 new leads for the commercial team;",
          "Created a Proof of Concept (POC) interface, only using JavaScript and HTML, that introduced a very simplified method for product registration on the platform (our main bottleneck);"
        ]
      },
      "hotmart-2": {
        "role": "Mid Level Front-End Engineer",
        "accomplishments": [
          "Designed from scratch a system to generate blog post images using components and pre-defined templates, using Vue.js/Nuxt.js for the interface, and Node.js for the assets API, thereby enhancing the productivity of the design team by 1000%;",
          "Created a high-performance caching system for the \"Hotmart blog\" (WordPress), using only some Nginx configs and PHP hooks, which resulted in a 300% increase in performance;",
          "Implemented the Arabic version of the \"Hotmart blog\" using pure CSS;"
        ]
      },
      "hotmart-1": {
        "role": "Entry Level Front-End Engineer",
        "accomplishments": [
          "Developed a new WordPress theme for the \"Hotmart blog\" utilizing only HTML5, CSS Grid Layout, and Vanilla JS;",
          "Implemented the new layout for the \"Hotmart blog\";",
          "Created custom features within the WordPress admin interface;"
        ]
      },
      "sydle-2": {
        "role": "Support Analyst",
        "accomplishments": [
          "Led the development of new web projects with WordPress and Magento;",
          "Added new features to a plataform built in Angular, Express and MySQL;",
          "Updated the modeling and automation of the company's internal processes through BPMN;",
          "Provided comprehensive technical support to users of the company's systems;",
          "Oversaw the configuration and monitoring of both Linux and Windows servers."
        ]
      },
      "sydle-1": {
        "role": "Support Associate",
        "accomplishments": [
          "Provided technical support to users of the company's systems;",
          "Configured and monitored infrastructure on Linux and Windows servers;",
          "Compiled team reports;",
          "Offered infrastructure support to the company's employees."
        ]
      }
    },
    "previousItemsText": {
      "prefix": "... and",
      "sufix": "other previous roles"
    },
    "imageAltText": {
      "prefix": "Logo of ",
      "sufix": " company"
    }
  },
  "education": {
    "title": "Education",
    "items": {
      "estacio": {
        "fieldOfStudy": "Strategic People Management",
        "degree": "MBA",
        "subjects": [
          "Coaching and Leadership",
          "Communication in Organizations",
          "Conflict Management and Negotiation",
          "Corporative Education",
          "Creativity and Organizational Innovation",
          "Finance Principles",
          "Knowledge Management",
          "Strategic Vision in People Management",
          "Theory of Organizational Development"
        ]
      },
      "fumec": {
        "fieldOfStudy": "Computer Science",
        "degree": "Bachelor",
        "subjects": [
          "Analytical Algebra and Geometry",
          "Programming Language and Techniques I",
          "Computer Architecture",
          "Fundamentals of Distributed Systems",
          "Calculus I",
          "Introduction to Logical Systems",
          "Programming Language and Techniques II",
          "Computer Networks",
          "Data Structures I",
          "Calculus II",
          "Programming Language and Techniques III",
          "Data Structures II",
          "Introduction to Robotics",
          "Statistics",
          "Programming Language and Techniques IV",
          "Human Resources Administration",
          "Connectivity",
          "Algorithm Analysis",
          "Operating Systems and Basic Software",
          "Introduction to Administration",
          "Fundamentals of Physics",
          "Human-Machine Interface",
          "Theoretical Foundations of Computing",
          "Telecommunications",
          "Analysis and Systems Design",
          "Software Engineering I",
          "Database I",
          "Compilers",
          "Computer Graphics",
          "Software Engineering II",
          "Law Applied to Informatics",
          "Database II",
          "Numerical Calculus",
          "Information Systems Administration",
          "Information Technology Project Management",
          "Security in Computer Networks",
          "Final Course Work",
          "Artificial Intelligence",
          "Web Development",
          "Development of Distributed Systems"
        ]
      }
    },
    "imageAltText": {
      "prefix": "Logo of ",
      "sufix": " school"
    }
  },
  "languages": {
    "items": {
      "pt": {
        "name": "Portuguese",
        "level": "Native"
      },
      "en": {
        "name": "English",
        "level": "C1"
      },
      "es": {
        "name": "Spanish",
        "level": "B1"
      }
    }
  },
  "skills": {
    "title": "Skills",
    "menu": {
      "all": "all",
      "hard": "hard",
      "soft": "soft"
    },
    "soft": {
      "leadership": "Leadership",
      "problem-solving": "Problem Solving",
      "stakeholder-management": "Stakeholder Management",
      "communication": "Communication",
      "decision-making": "Decision Making",
      "empathy": "Empathy",
      "conflict-resolution": "Conflict Resolution",
      "adaptability": "Adaptability",
      "time-management": "Time Management",
      "organization": "Organization",
      "strategic-thinking": "Strategic Thinking",
      "mentoring": "Mentoring",
      "negotiation": "Negotiation",
      "resilience": "Resilience",
      "critical-thinking": "Critical Thinking",
      "creativity": "Creativity",
      "active-listening": "Active Listening",
      "team-building": "Team Building",
      "ethical-decision-making": "Ethical Decision Making",
      "customer-orientation": "Customer Orientation",
      "learning-agility": "Learning Agility",
      "curiosity": "Curiosity",
      "patience": "Patience",
      "public-speaking": "Public Speaking",
      "networking": "Networking",
      "multitasking": "Multitasking",
      "attention-to-detail": "Attention to Detail",
      "motivation": "Motivation",
      "persuasion": "Persuasion",
      "emotional-intelligence": "Emotional Intelligence"
    },
    "bottomText": "And always learning new things to expand the list..."
  },
  "recommendations": {
    "title": "Recommendations",
    "items": {
      "1758032899095": {
        "role": "Director of Engineering",
        "paragraphs": [
          "Daniel is an exceptional engineer whom I had the pleasure of working with at Lovevery. Notably, Daniel was essential in the last mile push for the replatforming of the checkout flow into Next.js. Daniel was selected along with two other high performing individuals to deliver on the project. Without Daniel, the project would have floundered in the final months of the project. He delivered on key aspects of the checkout flow which utilized Stripe Elements for the UI components.",
          "Daniel was a FE engineer on the Subscription Squad, which focused on subscription growth and retention.",
          "I would absolutely recommend Daniel and welcome the chance to work with him again."
        ]
      },
      "1679942199683": {
        "role": "Front-End Engineer",
        "paragraphs": [
          "I had the pleasure to recommend Daniel, who brings over 12 years of exceptional experience in fullstack web development. His expertise in React, TypeScript, Next.js, Node.js, and JavaScript is truly unparalleled. Daniel consistently delivers elegant solutions to complex problems, combining technical prowess with a keen eye for design and user experience.",
          "As a seasoned Fullstack engineer and leader, Daniel excels in designing intuitive user interfaces and robust backend systems, ensuring top-notch performance, scalability, and security. He has a proven track record of successfully leading teams through complex projects, always achieving relevant and impactful results. His leadership style is rooted in collaboration and continuous improvement, fostering an environment where his teams are motivated to strive for excellence.",
          "I wholeheartedly recommend Daniel for any position that seeks a talented, experienced, and driven fullstack engineer."
        ]
      },
      "1719021291674": {
        "role": "Full-Stack Engineer",
        "paragraphs": [
          "I highly recommend Daniel for their expertise in React.js, TypeScript, Node.js, Clean Architecture, and Leadership. They deliver high-quality front-end solutions, build robust backend services, and ensure modular and maintainable codebases. As a natural leader, Daniel inspires and guides their team, fostering collaboration and productivity. Their technical skills and leadership make them an invaluable asset to any team."
        ]
      },
      "1716417055984": {
        "role": "Software Engineer",
        "paragraphs": [
          "I had the pleasure of working with Daniel Xavier at MEANING, and I can confidently say that he is an exceptional professional. Daniel stood out as a senior full-stack developer focused on front-end, with expertise in technologies such as React, Next.js, TypeScript, Node.js, and JavaScript. His technical ability is always far ahead of other team members.",
          "In addition to his advanced technical knowledge, Daniel is a proactive collaborator, always presenting innovative ideas that add value to projects. He has a natural ability to lead and inspire the team, creating a collaborative and productive work environment.",
          "I highly recommend Daniel Xavier for any position he applies for. I have full confidence that he will be a valuable addition to any team, bringing with him not only exceptional technical skills but also a positive attitude and exemplary work ethic."
        ]
      },
      "1665746687624": {
        "role": "Design Manager",
        "paragraphs": [
          "I had the opportunity to work with Daniel in co-leading the Design System at OLX, and his role was essential in building a strong community and an engaged team with the mission of scaling development and elevating the quality of our interfaces.",
          "He consistently made significant contributions in meetings, actively sharing his knowledge and insights to propel discussions forward. Furthermore, Daniel interacts effectively with all disciplines involved and identifies moments to mobilize teams towards impactful action.",
          "I highly recommend Daniel for leadership positions and reinforce my admiration for his professional commitment to business objectives and how he does not hesitate to invest effort in solving challenges along the way."
        ]
      },
      "1711736735188": {
        "role": "Senior Product Manager",
        "paragraphs": [
          "Daniel was a true partner specially when we were facing a business impact due to the pandemic. He worked non stop to come up with a solid business/tech plan together in order to recover from this scenario, also communicating what was needed to the management team.",
          "He is a people focused leader and makes effort to build a good team atmosphere. Also knows a lot about front-end technology and managed many different context teams."
        ]
      },
      "1692061488021": {
        "role": "Senior Staff Software Engineer",
        "paragraphs": [
          "I've had the opportunity to closely interact with Daniel during our teams' collaborative efforts, and I can attest to his qualities as a leader. Daniel brings positive energy to the table and demonstrates genuine interest in developing his team members and pairs. His commitment to delivering on agreed-upon solutions is unwavering, reflecting his dedication to meeting business objectives effectively. I recommend Daniel for any leadership role where his expertise will make a significant impact."
        ]
      },
      "1695594745530": {
        "role": "Product Designer",
        "paragraphs": [
          "Daniel is a very committed and dedicated professional. He is always interested in contributing in the best way possible and helping the team achieve its goals. If he doesn't know about the subject, he will try to collaborate in some way.",
          "He demonstrates a medium/long-term concern in his decisions, and manages to balance theory well with practice in his deliveries, which is essential for the healthy development of products and the team. In addition to having a great critical sense in several aspects, he clearly positively influenced the team's deliveries and strategic directions."
        ]
      },
      "1565735422940": {
        "role": "Principal Software Engineer",
        "paragraphs": [
          "Daniel is a great professional, always very committed. I worked with him at OLX Brasil, and saw him lead teams, always getting to know each of his team members, and using their skills positively to achieve relevant results. He was an example to be followed for his leadership, and will certainly be an excellent professional in his next challenges."
        ]
      },
      "1593552193665": {
        "role": "Software Engineering Manager",
        "paragraphs": [
          "Daniel is a very proactive and engaged professional. He was responsible for a more data-driven approach to monitoring web vitals at OLX Brasil, bringing greater visibility to the current situation and bringing the entire company to the topic. He has a strong problem-solving profile, strong leadership and achieves high engagement in his teams. Despite his management position, he has in-depth knowledge of front-end development, which helps with the technical development of his team members."
        ]
      },
      "1660079652443": {
        "role": "Senior Product Manager",
        "paragraphs": [
          "Daniel is an excellent, up-to-date professional. He demonstrates commitment, high technical knowledge, extremely collaborative. He always works for the common good and goals of the team and company. Always willing to share knowledge. Excellent addition to any company."
        ]
      },
      "1622852709278": {
        "role": "Engineering Manager",
        "paragraphs": [
          "Daniel is a very constructive person, who enjoys getting involved in different areas with assertive contributions and a lot of energy. He enjoys big challenges and being recognized for his contributions, sparing no effort to achieve goals. He also enjoys learning, relearning, collaborating, and sharing, enhancing other talents within the company. His good humor comes along with criticism regarding what can and should be improved, doing his part, seeking feedback, and asking for help with matters beyond his scope. Technically, he stood out in frontend work when we worked together, helping to shape other professionals who added a lot, and as a coordinator, he showed great organization, planning, and performance in complex projects, managing and caring for people, and providing good leadership within the team."
        ]
      },
      "1606086729239": {
        "role": "Data Analyst II",
        "paragraphs": [
          "Daniel is an excellent professional and I'd like to highlight his performance as a leader...",
          "I had the opportunity to work with him in two different teams and contexts. During this oppotunities I could witness a leader highly engaged in the development of each team member, including those ones that were not directly managed by him, such as me. Even during the period we were not on the same team, we had recurrent meetings, where he gave me a lot of orientations and helped me with my development.",
          "Furthermore, he was always concerned and showed interest in develop multidisciplinary solutions, bringing people from different areas of knowledge to the discussions.",
          "Daniel is a leader who is always available to help, guide and lead the team from the most everyday situations to the most urgent challenges."
        ]
      },
      "1683719518610": {
        "role": "Software Engineer",
        "paragraphs": [
          "During the period in which I was led by Dani I was able to witness his excellence as a manager. Your transparency stood out, transmitting confidence to the entire team!",
          "He is constantly concerned with the development of each team member, not only in terms of results, but also in career progression. He encouraged me to study relevant technical points and choose the tasks most beneficial to my growth and visibility within the company.",
          "Despite taking on a leadership role, Dani did not hesitate to get involved in technical issues. Actively collaborating on initiatives such as simplifying functions, solving problems with project components on other pages, and has always demonstrated a technical interest in understanding the functioning of different areas of the project to make the best decisions."
        ]
      },
      "1712709978402": {
        "role": "Engineering Manager",
        "paragraphs": [
          "I worked with Daniel and had the opportunity to be his leader and partner. As IC he was always very kind, proactive and very knowledgeable in frontend such as (JavaScript, React, Angular, etc.).",
          "As a peer, he demonstrated strong leadership skills in creating and managing teams. Excellent professional."
        ]
      },
      "1695221396520": {
        "role": "Software Engineer",
        "paragraphs": [
          "I had the pleasure of being led by Daniel at OLX. He was willing to help my professional growth from the beginning of our journey together, he was always available to help solve more complex problems and inspired me in the way he led with accurate questions and precise directions so that problems could be solved. This is because Daniel is a highly skilled professional in frontend stacks, with extensive knowledge of JavaScript. This knowledge, combined with the extensive experience he has as a leader and the calm and positive attitude he demonstrates, resulted in a very good experience on a daily basis. He was the best leader I ever had."
        ]
      },
      "1700516452017": {
        "role": "Senior Software Engineer",
        "paragraphs": [
          "I had the pleasure of working closely with Daniel Xavier at Softplan, where he excelled as our Tech Lead. Daniel is a standout front-end developer with expertise in JavaScript, React, TypeScript, and modern front-end practices like React Testing Library and GraphQL. His ability to architect scalable solutions and lead teams effectively sets him apart. Daniel's professionalism, reliability, and dedication to learning make him an invaluable asset to any team. I highly recommend Daniel for roles requiring top-tier front-end skills and strong leadership."
        ]
      },
      "1713311445833": {
        "role": "Senior Front-End Engineer",
        "paragraphs": [
          "Daniel is absolutely one of the most promising professionals I've met in my career!",
          "Very talkative professional, clear, and always have a point to put on the table to get rich some discussion.",
          "As tech lead (where I've worked with him), shows always open to listen and to help me and other colleagues.",
          "Daniel has the skill to see not only the micro but also the macro of the situation, so in this way supporting the team to achieve their goals in the best way possible!"
        ]
      }
    },
    "imageAltText": "Photo of the author"
  },
  "resume": {
    "title": "Resume",
    "sectionTitles": {
      "summary": "Summary",
      "skills": "Skills",
      "experience": "Experience",
      "education": "Education",
      "languages": "Languages"
    },
    "locationInfo": {
      "city": "Florianópolis",
      "state": "Santa Catarina",
      "country": "Brazil"
    }
  },
  "not-found": {
    "text": "There is no page here.",
    "link": "Let's see a real page!",
    "imageAltText": {
      "prefix": "Photo of the author",
      "sufix": "indicating a link with his finger"
    }
  }
}
