{
  "global": {
    "author": {
      "headline": "Tech Lead | Fullstack Engineer | Front-End focused | React | Next.js | TypeScript | Node.js | JavaScript | AWS | Leadership"
    },
    "copyright": "All rights reserved.",
    "menu": {
      "experience": "Experience",
      "education": "Education",
      "skills": "Skills",
      "recommendations": "Recommendations"
    }
  },
  "home": {
    "greeting": "Hey, I'm",
    "summary": [
      "With more than 12 years of experience in fullstack web development and expertise in React, TypeScript, Next.js, Node.js, and JavaScript, I have consistently delivered elegant solutions to complex challenges. My proficiency extends beyond technical skills, as I have successfully led teams on complex projects with relevant results.",
      "As an experienced Fullstack engineer and leader, I have a proven track record of designing intuitive user interfaces and robust backend systems, ensuring high performance, scalability, and security. My leadership style is rooted in collaboration and continuous improvement, driving my teams to achieve excellence.",
      "I am focused on obtaining an international/global opportunity as a Lead/Senior Full-Stack Engineer, designing and developing robust and scalable solutions with best practices, actively contributing to the company's goals and achieving great results together!"
    ],
    "imageAltText": "Photo of the author"
  },
  "experience": {
    "title": "Experience",
    "menu": {
      "simple": "simple",
      "detailed": "detailed"
    },
    "accomplishmentsTitle": "Main accomplishments",
    "biggestChallengeTitle": "Biggest challenge",
    "mainStackTitle": "Main stack",
    "items": {
      "danielxavier-1": {
        "role": "Technical Lead",
        "description": "A contractor role where I have been working on some independent client projects.",
        "accomplishments": [
          "Delegating tasks for associate developers, reviewing code, and ensuring deliveries for the customers;",
          "Created a high-performance and fully accessible professional portfolio website using React/Tailwind CSS to handle routing in the front, Next.js/Node.js to provide Server Side Rendering in the back end, Jest/Cypress to provide 100% code coverage including some visual tests, and Vercel's Frontend Cloud for deployment;",
          "Created a template-based app for printing medical reports using React to handle the dynamic fields in the front, Next.js/Node.js to provide Server Side Rendering in the back end, and Vercel's Frontend Cloud for deployment;",
          "Created a ticket booking API using the Nest.js framework (Node.js) to expose some different endpoints, Kong as an API gateway to manage all the requests, and MySQL to store the data in a simple relational database;"
        ],
        "biggestChallenge": "To quickly design and release projects from scratch and with few defined requirements."
      },
      "olx-4": {
        "role": "Technical Lead",
        "description": "A tech leader role (80% people / 20% hands-on) where I was responsible for a core team's results.",
        "accomplishments": [
          "I led a team of 9 developers, engaging them even in a crisis scenario, doing weekly 1:1s, and helping them with their technical challenges;",
          "We delivered the new Ad Insertion journey in stages, giving users a fluid and easier experience to sell items in the classified platform;",
          "We rewrote the mobile app with native technologies to improve the user experience and reduce the crashes;",
          "I mentored the team members through their performance cycles with clear and achievable goals for the next year;",
          "I led the team ceremonies with agile practices to ensure a streamlined workflow improving task throughput by 50%;",
          "I worked closely with the Product Manager to mitigate risks and make effective product decisions;"
        ],
        "biggestChallenge": "To deal with pressure from leadership to do major deliveries in the short term."
      },
      "olx-3": {
        "role": "Technical Lead",
        "description": "A double leadership role with a very technical team and a chapter once a week.",
        "accomplishments": [
          "I led a team of 8 developers, leveraging the strengths of each of them, doing weekly 1:1s, and supporting them in the technical decisions;",
          "We delivered a new LTR ranking algorithm that brings 10% more conversion in the Ad Recommendation system;",
          "I structured this team into 3 independent squads to support the strategic plan for next year and get them focused on each business domain;",
          "We used the Open AI API to help us in an annotation job with thousands of registries in a simple way and with 60% accuracy;",
          "I also led a Design System chapter with 9 developers, with a once-a-week work meeting, planning the tasks, and keeping them focused on the most valuable deliveries;",
          "We launched the Design System v3, bringing 30% more performance to all pages on the platform;"
        ],
        "biggestChallenge": "To balance the substantial responsibilities of both the team and the chapter simultaneously."
      },
      "olx-2": {
        "role": "Technical Lead",
        "description": "A tech leader role (70% people / 30% hands-on) where I was responsible for the Design System project.",
        "accomplishments": [
          "Partnered with the Design Manager to make optimal product decisions and define a product roadmap;",
          "Partnering leadership with the Design Manager to make optimal product decisions and define a product roadmap;",
          "We delivered the Design System roadmap, including a new platform home page, created in less than 48 hours;",
          "Guaranteed the continuous evolution of the Design System and its adoption by other teams in the company;",
          "I created some processes to contribute to the Design System project, bringing in 10 new external collaborators;"
        ],
        "biggestChallenge": "To assume multiple roles simultaneously, including Engineering Manager, Product Manager, Data Analyst, etc."
      },
      "olx-1": {
        "role": "Technical Lead",
        "description": "A tech leader role (90% people / 10% hands-on) where I was responsible for the Advertising system.",
        "accomplishments": [
          "I led a team of 7 developers, serving as a key reference, doing weekly 1:1s, and helping them interact with other teams;",
          "We delivered some advertising improvements to the platform that generated revenue of R$80 million;",
          "Recruited new professionals to increase production capacity by 300%, and be able to focus on the functionalities of the mobile application;",
          "I actively partnered with the Product Manager to prioritize and develop promising initiatives;",
          "I proposed a new structure for the entire Advertising area to enhance our results;"
        ],
        "biggestChallenge": "To manage high expectations related to Advertising revenue results."
      },
      "meaning-1": {
        "role": "CTO & Partner",
        "description": "I held the position of CTO and co-founder at the startup.",
        "accomplishments": [
          "I crafted the startup's technical vision and product strategy;",
          "We refined the product's technical specifications;",
          "I architected the solution from the ground up and we delivered it to 4 new clients;",
          "We developed a Proof of Concept project;"
        ],
        "biggestChallenge": "To find a way to convert a highly \"human-centric\" project, based on personal consultancy, into a systematic approach."
      },
      "softplan-3": {
        "role": "Team Leader",
        "description": "A multidisciplinary team leader role where I was responsible for the team results.",
        "accomplishments": [
          "I directly led a multidisciplinary software development team of 28 people including Developers, Quality Assurance analysts, Product Owners, Business Analysts, and Agile Masters;",
          "I made bi-weekly 1:1s to help the devs with the technical challenges, to help the QAs integrate their tasks with the team process flows, avoid creating bottlenecks and develop new automation test approaches, and the PO/BAs to handle the customer's urgent needs;",
          "I also guided the agile masters to structure and continuously enhance the team's workflow using agile software development methodologies;",
          "We planned and executed deliveries for the most 2 critical modules of the \"SAJ\" system;",
          "I have created formulas and metrics to accurately gauge the team's capacity, and sprint velocity, thereby bringing predictability to deliveries;"
        ],
        "biggestChallenge": "To manage such a large team and ensure critical deliveries."
      },
      "softplan-2": {
        "role": "Technical Lead",
        "description": "A tech leader position (80% tech / 20% people) where I was responsible for the Front-End best practices.",
        "accomplishments": [
          "I developed some Front-End modules for the new \"SAJ\" system, constructed using React and a Micro Frontend approach;",
          "I was responsible for the code reviews, deliveries, and deployment of 17 modules of the system;",
          "Provided training in HTML, CSS, JavaScript, React, GraphQL, and unit tests to keep the Delphi developers up to date and open new opportunities for them;",
          "I led a team of 10 Front-End developers, doing weekly 1:1s, and partnering with their coordinators to do career plans;",
          "We hired tons of new employees for the company and new contractor professionals aligned with our development culture;"
        ],
        "biggestChallenge": "To acquire leadership skills and master people management, balancing with hands-on work."
      },
      "softplan-1": {
        "role": "Senior Front-End Engineer",
        "description": "A pure hands-on position where I was responsible for doing all of my team's Front-End deliveries.",
        "accomplishments": [
          "I delivered our team's most critical and complex project in less than 6 months, helping the Product Owner improve some features;",
          "Developed new features for the \"e-SAJ\" portal helping attorneys in their jobs;",
          "I have created new features for the \"SAJ Tribunais\" system helping tons of law professionals in their work;"
        ],
        "biggestChallenge": "To manage all project deliveries as a single Front-End developer."
      },
      "hotmart-3": {
        "role": "Senior Full-Stack Engineer",
        "description": "A pure hands-on position where I was responsible for doing all of my team's full-stack deliveries.",
        "accomplishments": [
          "I developed a system to address the company's internal needs and automate tasks, using Vue.js/Nuxt.js for the user interface, Node.js/Express for the data requests, and MySQL for storing data, that brought more than 1000 new leads for the commercial team;",
          "I created a Proof of Concept (POC) interface, only using JavaScript and HTML, that introduced a very simplified method for product registration on the platform (our main bottleneck);"
        ],
        "biggestChallenge": "To balance the need to comprehend customer requirements clearly while simultaneously coding."
      },
      "hotmart-2": {
        "role": "Mid Level Front-End Engineer",
        "description": "A pure hands-on position where I was responsible for doing some of my team's full-stack deliveries.",
        "accomplishments": [
          "I designed from scratch a system to generate blog post images using components and pre-defined templates, using Vue.js/Nuxt.js for the interface, and Node.js for the assets API, thereby enhancing the productivity of the design team by 1000%;",
          "I created a high-performance caching system for the \"Hotmart blog\" (WordPress), using only some Nginx configs and PHP hooks, which resulted in a 300% increase in performance;",
          "I implemented the Arabic version of the \"Hotmart blog\" using pure CSS;"
        ],
        "biggestChallenge": "To design and develop complex solutions from the ground up."
      },
      "hotmart-1": {
        "role": "Entry Level Front-End Engineer",
        "description": "I was an Entry Level Front-End developer on the \"User Acquisition\" team.",
        "accomplishments": [
          "Developed a new WordPress theme for the \"Hotmart blog\" utilizing only HTML5, CSS Grid Layout, and Vanilla JS;",
          "Implemented the new layout for the \"Hotmart blog\";",
          "Created custom features within the WordPress admin interface;"
        ],
        "biggestChallenge": "To acquire new development skills and apply them to complex projects."
      },
      "sydle-2": {
        "role": "Support Analyst",
        "description": "I was a Support Analyst on the \"Suporte & Sustentação\" team.",
        "accomplishments": [
          "Spearheaded the development of web projects utilizing WordPress and Magento;",
          "Facilitated the modeling and automation of the company's internal processes through BPMN;",
          "Provided comprehensive technical support to users of the company's systems;",
          "Oversaw the configuration and monitoring of both Linux and Windows servers."
        ],
        "biggestChallenge": "To rapidly acquire development skills and contribute to legacy projects."
      },
      "sydle-1": {
        "role": "Support Associate",
        "description": "I was a Support Associate on the \"Suporte & Sustentação\" team.",
        "accomplishments": [
          "Provided technical support to users of the company's systems;",
          "Configured and monitored infrastructure on Linux and Windows servers;",
          "Compiled team reports;",
          "Offered infrastructure support to the company's employees."
        ],
        "biggestChallenge": "To simultaneously learn a multitude of new concepts and balance them with my university commitments."
      }
    },
    "previousItemsText": {
      "prefix": "... and",
      "sufix": "other previous roles"
    },
    "imageAltText": {
      "prefix": "Logo of ",
      "sufix": " company"
    }
  },
  "education": {
    "title": "Education",
    "items": {
      "estacio": {
        "fieldOfStudy": "Strategic People Management",
        "degree": "Master of Business Administration - MBA",
        "subjects": [
          "Coaching and Leadership",
          "Communication in Organizations",
          "Conflict Management and Negotiation",
          "Corporative Education",
          "Creativity and Organizational Innovation",
          "Finance Principles",
          "Knowledge Management",
          "Strategic Vision in People Management",
          "Theory of Organizational Development"
        ]
      },
      "fumec": {
        "fieldOfStudy": "Computer Science",
        "degree": "Bachelor",
        "subjects": [
          "Analytical Algebra and Geometry",
          "Programming Language and Techniques I",
          "Computer Architecture",
          "Fundamentals of Distributed Systems",
          "Calculus I",
          "Introduction to Logical Systems",
          "Programming Language and Techniques II",
          "Computer Networks",
          "Data Structures I",
          "Calculus II",
          "Programming Language and Techniques III",
          "Data Structures II",
          "Introduction to Robotics",
          "Statistics",
          "Programming Language and Techniques IV",
          "Human Resources Administration",
          "Connectivity",
          "Algorithm Analysis",
          "Operating Systems and Basic Software",
          "Introduction to Administration",
          "Fundamentals of Physics",
          "Human-Machine Interface",
          "Theoretical Foundations of Computing",
          "Telecommunications",
          "Analysis and Systems Design",
          "Software Engineering I",
          "Database I",
          "Compilers",
          "Computer Graphics",
          "Software Engineering II",
          "Law Applied to Informatics",
          "Database II",
          "Numerical Calculus",
          "Information Systems Administration",
          "Information Technology Project Management",
          "Security in Computer Networks",
          "Final Course Work",
          "Artificial Intelligence",
          "Web Development",
          "Development of Distributed Systems"
        ]
      }
    },
    "imageAltText": {
      "prefix": "Logo of ",
      "sufix": " school"
    }
  },
  "skills": {
    "title": "Skills",
    "menu": {
      "all": "all",
      "hard": "hard",
      "soft": "soft"
    },
    "soft": {
      "leadership": "Leadership",
      "problem-solving": "Problem Solving",
      "stakeholder-management": "Stakeholder Management",
      "communication": "Communication",
      "decision-making": "Decision Making",
      "empathy": "Empathy",
      "conflict-resolution": "Conflict Resolution",
      "adaptability": "Adaptability",
      "time-management": "Time Management",
      "organization": "Organization",
      "strategic-thinking": "Strategic Thinking",
      "mentoring": "Mentoring",
      "negotiation": "Negotiation",
      "resilience": "Resilience",
      "critical-thinking": "Critical Thinking",
      "creativity": "Creativity",
      "active-listening": "Active Listening",
      "team-building": "Team Building",
      "ethical-decision-making": "Ethical Decision Making",
      "customer-orientation": "Customer Orientation",
      "learning-agility": "Learning Agility",
      "curiosity": "Curiosity",
      "patience": "Patience",
      "public-speaking": "Public Speaking",
      "networking": "Networking",
      "multitasking": "Multitasking",
      "attention-to-detail": "Attention to Detail",
      "motivation": "Motivation",
      "persuasion": "Persuasion",
      "emotional-intelligence": "Emotional Intelligence"
    },
    "bottomText": "And always learning new things to expand the list..."
  },
  "recommendations": {
    "title": "Recommendations",
    "items": {
      "1716417055984": {
        "role": "Software Engineer",
        "paragraphs": [
          "I had the pleasure of working with Daniel Xavier at MEANING, and I can confidently say that he is an exceptional professional. Daniel stood out as a senior full-stack developer focused on front-end, with expertise in technologies such as React, Next.js, TypeScript, Node.js, and JavaScript. His technical ability is always far ahead of other team members.",
          "In addition to his advanced technical knowledge, Daniel is a proactive collaborator, always presenting innovative ideas that add value to projects. He has a natural ability to lead and inspire the team, creating a collaborative and productive work environment.",
          "I highly recommend Daniel Xavier for any position he applies for. I have full confidence that he will be a valuable addition to any team, bringing with him not only exceptional technical skills but also a positive attitude and exemplary work ethic."
        ]
      },
      "1665746687624": {
        "role": "Design Manager",
        "paragraphs": [
          "I had the opportunity to work with Daniel in co-leading the Design System at OLX, and his role was essential in building a strong community and an engaged team with the mission of scaling development and elevating the quality of our interfaces.",
          "He consistently made significant contributions in meetings, actively sharing his knowledge and insights to propel discussions forward. Furthermore, Daniel interacts effectively with all disciplines involved and identifies moments to mobilize teams towards impactful action.",
          "I highly recommend Daniel for leadership positions and reinforce my admiration for his professional commitment to business objectives and how he does not hesitate to invest effort in solving challenges along the way."
        ]
      },
      "1711736735188": {
        "role": "Senior Product Manager",
        "paragraphs": [
          "Daniel was a true partner specially when we were facing a business impact due to the pandemic. He worked non stop to come up with a solid business/tech plan together in order to recover from this scenario, also communicating what was needed to the management team.",
          "He is a people focused leader and makes effort to build a good team atmosphere. Also knows a lot about front-end technology and managed many different context teams."
        ]
      },
      "1692061488021": {
        "role": "Senior Staff Software Engineer",
        "paragraphs": [
          "I've had the opportunity to closely interact with Daniel during our teams' collaborative efforts, and I can attest to his qualities as a leader. Daniel brings positive energy to the table and demonstrates genuine interest in developing his team members and pairs. His commitment to delivering on agreed-upon solutions is unwavering, reflecting his dedication to meeting business objectives effectively. I recommend Daniel for any leadership role where his expertise will make a significant impact."
        ]
      },
      "1695594745530": {
        "role": "Product Designer",
        "paragraphs": [
          "Daniel is a very committed and dedicated professional. He is always interested in contributing in the best way possible and helping the team achieve its goals. If he doesn't know about the subject, he will try to collaborate in some way.",
          "He demonstrates a medium/long-term concern in his decisions, and manages to balance theory well with practice in his deliveries, which is essential for the healthy development of products and the team. In addition to having a great critical sense in several aspects, he clearly positively influenced the team's deliveries and strategic directions."
        ]
      },
      "1565735422940": {
        "role": "Principal Software Engineer",
        "paragraphs": [
          "Daniel is a great professional, always very committed. I worked with him at OLX Brasil, and saw him lead teams, always getting to know each of his team members, and using their skills positively to achieve relevant results. He was an example to be followed for his leadership, and will certainly be an excellent professional in his next challenges."
        ]
      },
      "1593552193665": {
        "role": "Software Engineering Manager",
        "paragraphs": [
          "Daniel is a very proactive and engaged professional. He was responsible for a more data-driven approach to monitoring web vitals at OLX Brasil, bringing greater visibility to the current situation and bringing the entire company to the topic. He has a strong problem-solving profile, strong leadership and achieves high engagement in his teams. Despite his management position, he has in-depth knowledge of front-end development, which helps with the technical development of his team members."
        ]
      },
      "1660079652443": {
        "role": "Senior Product Manager",
        "paragraphs": [
          "Daniel is an excellent, up-to-date professional. He demonstrates commitment, high technical knowledge, extremely collaborative. He always works for the common good and goals of the team and company. Always willing to share knowledge. Excellent addition to any company."
        ]
      },
      "1622852709278": {
        "role": "Engineering Manager",
        "paragraphs": [
          "Daniel is a very constructive person, who enjoys getting involved in different areas with assertive contributions and a lot of energy. He enjoys big challenges and being recognized for his contributions, sparing no effort to achieve goals. He also enjoys learning, relearning, collaborating, and sharing, enhancing other talents within the company. His good humor comes along with criticism regarding what can and should be improved, doing his part, seeking feedback, and asking for help with matters beyond his scope. Technically, he stood out in frontend work when we worked together, helping to shape other professionals who added a lot, and as a coordinator, he showed great organization, planning, and performance in complex projects, managing and caring for people, and providing good leadership within the team."
        ]
      },
      "1606086729239": {
        "role": "Data Analyst II",
        "paragraphs": [
          "Daniel is an excellent professional and I'd like to highlight his performance as a leader...",
          "I had the opportunity to work with him in two different teams and contexts. During this oppotunities I could witness a leader highly engaged in the development of each team member, including those ones that were not directly managed by him, such as me. Even during the period we were not on the same team, we had recurrent meetings, where he gave me a lot of orientations and helped me with my development.",
          "Furthermore, he was always concerned and showed interest in develop multidisciplinary solutions, bringing people from different areas of knowledge to the discussions.",
          "Daniel is a leader who is always available to help, guide and lead the team from the most everyday situations to the most urgent challenges."
        ]
      },
      "1683719518610": {
        "role": "Software Engineer",
        "paragraphs": [
          "During the period in which I was led by Dani I was able to witness his excellence as a manager. Your transparency stood out, transmitting confidence to the entire team!",
          "He is constantly concerned with the development of each team member, not only in terms of results, but also in career progression. He encouraged me to study relevant technical points and choose the tasks most beneficial to my growth and visibility within the company.",
          "Despite taking on a leadership role, Dani did not hesitate to get involved in technical issues. Actively collaborating on initiatives such as simplifying functions, solving problems with project components on other pages, and has always demonstrated a technical interest in understanding the functioning of different areas of the project to make the best decisions."
        ]
      },
      "1712709978402": {
        "role": "Engineering Manager",
        "paragraphs": [
          "I worked with Daniel and had the opportunity to be his leader and partner. As IC he was always very kind, proactive and very knowledgeable in frontend such as (JavaScript, React, Angular, etc.).",
          "As a peer, he demonstrated strong leadership skills in creating and managing teams. Excellent professional."
        ]
      },
      "1695221396520": {
        "role": "Software Engineer",
        "paragraphs": [
          "I had the pleasure of being led by Daniel at OLX. He was willing to help my professional growth from the beginning of our journey together, he was always available to help solve more complex problems and inspired me in the way he led with accurate questions and precise directions so that problems could be solved. This is because Daniel is a highly skilled professional in frontend stacks, with extensive knowledge of JavaScript. This knowledge, combined with the extensive experience he has as a leader and the calm and positive attitude he demonstrates, resulted in a very good experience on a daily basis. He was the best leader I ever had."
        ]
      },
      "1700516452017": {
        "role": "Senior Software Engineer",
        "paragraphs": [
          "I had the pleasure of working closely with Daniel Xavier at Softplan, where he excelled as our Tech Lead. Daniel is a standout front-end developer with expertise in JavaScript, React, TypeScript, and modern front-end practices like React Testing Library and GraphQL. His ability to architect scalable solutions and lead teams effectively sets him apart. Daniel's professionalism, reliability, and dedication to learning make him an invaluable asset to any team. I highly recommend Daniel for roles requiring top-tier front-end skills and strong leadership."
        ]
      },
      "1713311445833": {
        "role": "Senior Front-End Engineer",
        "paragraphs": [
          "Daniel is absolutely one of the most promising professionals I've met in my career!",
          "Very talkative professional, clear, and always have a point to put on the table to get rich some discussion.",
          "As tech lead (where I've worked with him), shows always open to listen and to help me and other colleagues.",
          "Daniel has the skill to see not only the micro but also the macro of the situation, so in this way supporting the team to achieve their goals in the best way possible!"
        ]
      }
    },
    "imageAltText": "Photo of the author"
  },
  "resume": {
    "title": "Resume",
    "sectionTitles": {
      "summary": "Summary",
      "skills": "Skills",
      "experience": "Experience",
      "education": "Education"
    }
  },
  "not-found": {
    "text": "There is no page here.",
    "link": "Let's see a real page!",
    "imageAltText": {
      "prefix": "Photo of the author",
      "sufix": "indicating a link with his finger"
    }
  }
}
